Examinator/src/InformationRegisters/ПроведениеПодчиненныхМероприятийСУО/ПроведениеПодчиненныхМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроведениеПодчиненныхМероприятийСУО</name>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.АудиторииСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаПроведения</name>
    <type>
      <types>CatalogRef.СхемыМероприятийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/МестаПроведенияМероприятийСУО/МестаПроведенияМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МестаПроведенияМероприятийСУО</name>
  <enumValues>
    <name>Аудитория</name>
  </enumValues>
  <enumValues>
    <name>Дистанционно</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/ПроведениеПодчиненныхМероприятийСУО/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ФормаВладелец; // Форма, из которой открыта эта форма

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Общее

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Получаем данные формы
	//
	
	ДанныеОМероприятии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Мероприятие, "Вид, МестоПроведения, ТипАудитории, ПродолжительностьВСекундах");
	
    ТребуемыйТипАудитории                 = ДанныеОМероприятии.ТипАудитории; // Реквизит
	ПродолжительностьМероприятияВСекундах = ДанныеОМероприятии.ПродолжительностьВСекундах; // Реквизит

	РолиПреподавателей       = Документы.ПроведениеОбученияСУО.РолиПреподавателей(Запись.ПроведениеОбучения, Запись.Мероприятие);
	КоличествоПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(Запись.ПроведениеОбучения, Запись.Мероприятие).Количество();

	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Преподаватели, Запись.ПроведениеОбучения, "ПроведениеОбучения");
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Преподаватели, Запись.Мероприятие, "Мероприятие");
	
	// Устанавливаем доступность элементов формы
	//
	
	// Дата проведения
	
	Если ДанныеОМероприятии.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория ИЛИ НЕ ДанныеОМероприятии.Вид.Электронное Тогда
		Элементы.ГруппаДатаПроведения.Видимость = Истина;
	Иначе
		Элементы.ГруппаДатаПроведения.Видимость = Ложь;
	КонецЕсли;
	
	// Аудитория
	
	Если ДанныеОМероприятии.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория Тогда
		Элементы.Аудитория.Видимость = Истина;
	Иначе
		Элементы.Аудитория.Видимость = Ложь;
	КонецЕсли;
	
	// Адрес в Интернет
	
	Если НЕ ДанныеОМероприятии.Вид.Общее И НЕ ДанныеОМероприятии.Вид.Электронное И ДанныеОМероприятии.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Дистанционно Тогда
		Элементы.ГруппаАдресВИнтернете.Видимость = Истина;	
	Иначе
		Элементы.ГруппаАдресВИнтернете.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

// Преподаватели

&НаКлиенте
Процедура ЗачислитьПреподавателяНаКлиенте(Преподаватель, Роль) Экспорт
	
	Оповестить("ЗачисленПреподаватель", Запись.ПроведениеОбучения, ЭтотОбъект);
	
	ЗачислитьПреподавателя(Преподаватель, Роль);
	
КонецПроцедуры

&НаСервере
Процедура ЗачислитьПреподавателя(Преподаватель, Роль)
		
	УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение(Запись.ПроведениеОбучения, Запись.Мероприятие, Преподаватель, Роль);
	
	КоличествоПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(Запись.ПроведениеОбучения, Запись.Мероприятие).Количество();
	
	Элементы.Преподаватели.Обновить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.ПроведениеОбучения) Тогда
		Текст = НСтр("ru = 'Заполните поле ""Проведение обучения""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.СхемаПроведения) Тогда
		Текст = НСтр("ru = 'Заполните поле ""Схема проведения""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Мероприятие) Тогда
		Текст = НСтр("ru = 'Заполните поле ""Мероприятие""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	// Примечание: записи регистра создаются всегда программно, а не интерактивно.
	
	УстановитьДоступностьЭлементовФормы();
	
	ДатаНачалаПроведения    = Запись.ДатаПроведения;
	ВремяНачалаПроведения   = Запись.ДатаПроведения;
	
	ДатаОкончанияПроведения = Запись.ДатаПроведения + ПродолжительностьМероприятияВСекундах;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФормаВладелец = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(ВладелецФормы);
	
	Если ФормаВладелец = Неопределено
		ИЛИ ФормаВладелец.ИмяФормы <> "Документ.ПроведениеОбученияСУО.Форма.ФормаДокумента" Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru = 'Владелец формы не найден или задан неверно'"));
		Возврат;
		
	КонецЕсли;
	
	МаксимальноеКоличествоЧеловек = ФормаВладелец.Объект.МаксимальноеКоличествоУчастников;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ФормаВладелец.Модифицированность = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ПерейтиКИнтернетРесурсу(Команда)
	
	Если ЗначениеЗаполнено(Запись.АдресВИнтернете) Тогда
		ПерейтиПоНавигационнойСсылке(Запись.АдресВИнтернете);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДатаНачалаПроведенияПриИзменении(Элемент)
	
	Запись.ДатаПроведения = НачалоДня(ДатаНачалаПроведения) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(ВремяНачалаПроведения);
    ДатаОкончанияПроведения = Запись.ДатаПроведения + ПродолжительностьМероприятияВСекундах;

КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПроведенияПриИзменении(Элемент)
	
	Запись.ДатаПроведения = НачалоДня(ДатаНачалаПроведения) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(ВремяНачалаПроведения);
    ДатаОкончанияПроведения = Запись.ДатаПроведения + ПродолжительностьМероприятияВСекундах;

КонецПроцедуры

&НаКлиенте
Процедура АудиторияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйМассив = Новый Массив();

	НовыйМассив.Добавить(Новый ПараметрВыбора("ДокументСобытия", Запись.ПроведениеОбучения));
	НовыйМассив.Добавить(Новый ПараметрВыбора("ДатаНачалаИспользования", Запись.ДатаПроведения));
	НовыйМассив.Добавить(Новый ПараметрВыбора("ДатаОкончанияИспользования", Запись.ДатаПроведения + ПродолжительностьМероприятияВСекундах));
	НовыйМассив.Добавить(Новый ПараметрВыбора("ТипАудитории", ТребуемыйТипАудитории));
	НовыйМассив.Добавить(Новый ПараметрВыбора("МаксимальноеКоличествоЧеловек", МаксимальноеКоличествоЧеловек));

	Элементы.Аудитория.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ Преподаватели

&НаКлиенте
Процедура ПреподавателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено
		ИЛИ НЕ ТекущиеДанные.Свойство("Ссылка") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.Проведен Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПреподавателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	УправлениеОбучениемСУОКлиент.ВыбратьРольПреподавателя(РолиПреподавателей, ЭтотОбъект, "ВыбратьПреподавателя");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
